cask_args appdir: '/Applications'

# core developer dependencies
cask 'java'
brew 'mysql@5.6'
brew 'postgresql95'
brew 'python'
brew 'sbt'
brew 'gradle'
cask 'slack'
brew 'maven'
cask 'docker-toolbox'
cask 'virtualbox'
cask 'vagrant'
brew 'git'
brew 'gnu-tar'
brew 'jq'
brew 'redis'
brew 'ansible'

# developer apps
cask 'slack'
cask 'tunnelblick'
cask 'spectacle'
cask 'sourcetree'
cask 'sequel-pro'
cask 'sqlworkbenchj'
cask 'google-drive-file-stream'
cask 'dropbox'

# Logging
brew 'logstash24'

# tools
brew 'coreutils'
brew 'findutils'
cask 'google-chrome'
cask 'intellij-idea-ce'
cask 'iterm2'
brew 'nginx'
brew 'openssl'
